# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Rob\Documents\personal\git\Dual-PSoC-DCO\Dual-PSoC-DCO.cydsn\Dual-PSoC-DCO.cyprj
# Date: Wed, 29 Jun 2016 12:03:41 GMT
#set_units -time ns
create_clock -name {Clock_3(routed)} -period 13653.333333333332 -waveform {0 6826.66666666667} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {ADC_DelSig_1_Ext_CP_Clk(routed)} -period 13.333333333333332 -waveform {0 6.66666666666667} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {timer_clock(routed)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {OSC1_ADC_SAR_IntClock(routed)} -period 626.66666666666663 -waveform {0 313.333333333333} [list [get_pins {ClockBlock/dclk_3}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 13.333333333333332 -waveform {0 6.66666666666667} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 13.333333333333332 -waveform {0 6.66666666666667} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_3} -source [get_pins {ClockBlock/clk_sync}] -edges {1 1025 2049} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_clock -name {ADC_DelSig_1_Ext_CP_Clk} -period 13.333333333333332 -waveform {0 6.66666666666667} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {ADC_DelSig_1_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 25 49} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_clock -name {ADC_DelSig_1_theACLK(fixed-function)} -period 320 -waveform {0 160} [get_pins {ClockBlock/aclk_glb_ff_0}]
create_generated_clock -name {OSC1_ADC_SAR_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 47 95} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 601 1201} -nominal_period 7999.9999999999991 [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 601 1201} -nominal_period 7999.9999999999991 [list [get_pins {ClockBlock/dclk_glb_5}]]
create_generated_clock -name {timer_clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 7} -nominal_period 41.666666666666664 [list [get_pins {ClockBlock/dclk_glb_2}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\Rob\Documents\personal\git\Dual-PSoC-DCO\Dual-PSoC-DCO.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Rob\Documents\personal\git\Dual-PSoC-DCO\Dual-PSoC-DCO.cydsn\Dual-PSoC-DCO.cyprj
# Date: Wed, 29 Jun 2016 12:03:24 GMT
